# 판다스 기본 다지기

### 데이터셋 다지기

In [2]:
import pandas as pd

In [3]:
pd.read_csv("movies.csv")

     Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]

read_csv함수를 이용해서 movies.csv 함수를 사용합니다. 판다스에는 CSV 파일의 내용을 DataFrame이라는 객체로 가져옵니다.
판다스는 한 가지 유형의 객체(DataFrame)를 사용해서 다중 열의 데이터셋을 저장하고 다른 유형의 객체(Series)를 사용하여 단일 열 데이터셋을 저장합니다.

In [4]:
pd.read_csv("movies.csv", index_col = "Title")

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

자동 생성된 숫자 인덱스를 Title열의 값으로 교체

In [6]:
movies = pd.read_csv("movies.csv", index_col = 'Title')

다른 곳에서 참조 할수 있도록 DataFrame을 movies 변수에 할당합니다.

### DataFrame 조작

In [7]:
movies.head(4)

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015

맨 위에 4개의 행만 추출

In [8]:
movies.tail(6)

                          Rank           Studio     Gross  Year
Title
21 Jump Street             777             Sony  $201.60   2012
Yogi Bear                  778  Warner Brothers  $201.60   2010
Garfield: The Movie        779              Fox  $200.80   2004
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

또는 데이터셋의 마지막 몇 행을 확인할 수도 있습니다.

In [9]:
len(movies)

782

DataFrame에 몇 개의 행이 있는지 확인이 가능하다.

In [10]:
movies.shape

(782, 4)

DataFrame의 행과 열 개수도 확인 가능(4개의 열, 782개의 행)

In [11]:
movies.size

3128

총 셀 개수를 확인 가능

In [12]:
movies.dtypes

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

4개의 데이터 열 확인 가능

In [13]:
movies.iloc[499]

Rank           500
Studio         Fox
Gross     $288.30
Year          2018
Name: Maze Runner: The Death Cure, dtype: object

500번째에 있는 영화 꺼내기(데이터셋 행 추출) 여기서 1차원 레이블이 지정된 값 배열인 Series라는 새 객체를 반환

In [14]:
movies.loc["Forrest Gump"]

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object

인덱스 레이블을 통해 DataFrame 행에 접근

In [15]:
movies.loc["101 Dalmatians"]

                Rank       Studio     Gross  Year
Title
101 Dalmatians   425  Buena Vista  $320.70   1996
101 Dalmatians   708  Buena Vista  $215.90   1961

인덱스 레이블에는 중복 항목이 있을 수도 있음 1996년에 재개봉한 영화와 1961년에 개봉한 영화(중복은 허용하지만 가능하면 인덱스 레이블을 고유하게 유지하게 하는 것이 좋음)

In [16]:
movies.sort_values(by = "Year", ascending = False).head()

,Rank,Studio,Gross,Year
Title,,,,
Avengers: Endgame,1,Buena Vista,"$2,796.30",2019
John Wick: Chapter 3 - Parabellum,458,Lionsgate,$304.70,2019
The Wandering Earth,114,China Film Corporation,$699.80,2019
Toy Story 4,198,Buena Vista,$519.80,2019
How to Train Your Dragon: The Hidden World,199,Universal,$519.80,2019

CSV에 있는 영화는 Rank를 기준으로 정렬이 됩니다.(첫 번째에 있어서) 가장 최근에 개봉한 영화를 찾는 법 정렬 기준을 "Year"로 하고 ascending(오름차순)은 False로 하고 head() 함수를 통해서 정렬된 DataFrame에서 맨위에 있는 5개만 보이게 하는 것이다.

한마디로 말하면 "Year기준으로 내림차순으로 정렬"

In [17]:
movies.sort_values(by = ["Studio", "Year"]).head()

                         Rank       Studio     Gross  Year
Title
The Blair Witch Project   588      Artisan  $248.60   1999
101 Dalmatians            708  Buena Vista  $215.90   1961
The Jungle Book           755  Buena Vista  $205.80   1967
Who Framed Roger Rabbit   410  Buena Vista  $329.80   1988
Dead Poets Society        636  Buena Vista  $235.90   1989

여러 열로도 DataFrame을 정렬할 수 있음 먼저 Studio로 정렬 후 Year 열의 값을 기준으로 정렬을 진행합니다.

In [18]:
movies.sort_index().head()

                  Rank           Studio     Gross  Year
Title
10,000 B.C.        536  Warner Brothers  $269.80   2008
101 Dalmatians     708      Buena Vista  $215.90   1961
101 Dalmatians     425      Buena Vista  $320.70   1996
2 Fast 2 Furious   632        Universal  $236.40   2003
2012                93             Sony  $769.70   2009

알파벳 순서대로 정렬

### Series 값 계산

In [19]:
movies["Studio"]

Title
Avengers: Endgame                   Buena Vista
Avatar                                      Fox
Titanic                               Paramount
Star Wars: The Force Awakens        Buena Vista
Avengers: Infinity War              Buena Vista
                                     ...
Yogi Bear                       Warner Brothers
Garfield: The Movie                         Fox
Cats & Dogs                     Warner Brothers
The Hunt for Red October              Paramount
Valkyrie                                    MGM
Name: Studio, Length: 782, dtype: object

DataFrame에서 데이터의 단일 열을 Series로 추출 할 수 있다. 판단스는 영화 제목을 Series로 가지고 있다.

In [20]:
movies["Studio"].value_counts().head(10)

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Paramount           76
Dreamworks          27
Lionsgate           21
New Line            16
MGM                 11
Name: count, dtype: int64

위의 반환 값은 Series 객체이다.

### 하나 이상의 기준으로 열 필터링

In [21]:
movies[movies["Studio"] == "Universal"]

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

유니버셜 스튜디오에서 제작한 영화만 찾고 싶을때는 이런씩으로 한다.

In [22]:
released_by_universal = (movies["Studio"] == "Universal")

In [23]:
movies[released_by_universal].head()

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015

필터링 조건을 변수에 할당하면 가독성을 높일 수 있다.

In [24]:
released_by_universal = movies["Studio"] == "Universal"

In [25]:
released_in_2015 = movies["Year"] == 2015

In [26]:
movies[released_by_universal & released_in_2015]

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

여러 기준으로 DataFrame 행을 필터링할 수도 있다. 'Universal'에서 제작하고 2015년에 개봉한 모든 영화을 필터링한다.

In [27]:
released_by_universal = movies["Studio"] == "Universal"
released_in_2015 = movies["Year"] == 2015
movies[released_by_universal | released_in_2015]

                                Rank       Studio       Gross  Year
Title
Star Wars: The Force Awakens       4  Buena Vista  $2,068.20   2015
Jurassic World                     6    Universal  $1,671.70   2015
Furious 7                          8    Universal  $1,516.00   2015
Avengers: Age of Ultron            9  Buena Vista  $1,405.40   2015
Jurassic World: Fallen Kingdom    13    Universal  $1,309.50   2018
...                              ...          ...         ...   ...
The Break-Up                     763    Universal    $205.00   2006
Everest                          766    Universal    $203.40   2015
Patch Adams                      772    Universal    $202.30   1998
Kindergarten Cop                 775    Universal    $202.00   1990
Straight Outta Compton           776    Universal    $201.60   2015

[140 rows x 4 columns]

'Universal'에서 제작하고 또는 2015년에 제작한 영화들만 필터링한 것이다.

In [28]:
before_1975 = movies["Year"] < 1975
movies[before_1975]

                    Rank           Studio     Gross  Year
Title
The Exorcist         252  Warner Brothers  $441.30   1973
Gone with the Wind   288              MGM  $402.40   1939
Bambi                540              RKO  $267.40   1942
The Godfather        604        Paramount  $245.10   1972
101 Dalmatians       708      Buena Vista  $215.90   1961
The Jungle Book      755      Buena Vista  $205.80   1967

1975년 이전에 개봉한 영화들을 필터링한 예제이다.

In [29]:
mid_80s = movies["Year"].between(1983, 1986)
movies[mid_80s]

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

특정 범위에서 필터링을 걸때 방법이다. 1983년에서 1986년 사이에 개봉한 영화를 필터링하는 방법이다.

In [30]:
has_dark_in_title = movies.index.str.lower().str.contains("dark")
movies[has_dark_in_title]

                                Rank           Studio       Gross  Year
Title
Transformers: Dark of the Moon    23        Paramount  $1,123.80   2011
The Dark Knight Rises             27  Warner Brothers  $1,084.90   2012
The Dark Knight                   39  Warner Brothers  $1,004.90   2008
Thor: The Dark World             132      Buena Vista    $644.60   2013
Star Trek Into Darkness          232        Paramount    $467.40   2013
Fifty Shades Darker              309        Universal    $381.50   2017
Dark Shadows                     600  Warner Brothers    $245.50   2012
Dark Phoenix                     603              Fox    $245.10   2019

DataFrame 인덱스를 사용하여 행을 필터릴 할 수도 있음 dark가 포함된 영화를 찾는 코드이다.

movies에서 index키워드로 Title을 가져와 str.lower()을 써서 소문자로 만든후 str.contains()을 써서 dark가 포함되어있는 영화 필터링을 만들었다.

### 데이터 그룹화

In [31]:
movies["Gross"].str.replace(
    "$", "", regex = False
    ).str.replace(",", "", regex = False)

Title
Avengers: Endgame               2796.30
Avatar                          2789.70
Titanic                         2187.50
Star Wars: The Force Awakens    2068.20
Avengers: Infinity War          2048.40
                                  ...
Yogi Bear                        201.60
Garfield: The Movie              200.80
Cats & Dogs                      200.70
The Hunt for Red October         200.50
Valkyrie                         200.30
Name: Gross, Length: 782, dtype: object

어떤 제작사에서 제작한 영화가 가장 수입이 높은지 알아보자. 그러기 위해서는 달러 기호와 쉼표 표시를 제거하자.

In [32]:
(
    movies["Gross"]
    .str.replace("$", "", regex = False)
    .str.replace(",", "", regex = False)
    .astype(float)
)

Title
Avengers: Endgame               2796.3
Avatar                          2789.7
Titanic                         2187.5
Star Wars: The Force Awakens    2068.2
Avengers: Infinity War          2048.4
                                 ...
Yogi Bear                        201.6
Garfield: The Movie              200.8
Cats & Dogs                      200.7
The Hunt for Red October         200.5
Valkyrie                         200.3
Name: Gross, Length: 782, dtype: float64

기호를 제거하면 Gross 열의 값을 텍스트에서 부동 소수점 숫자로 변환할 수 있습니다. astype로 (float)로 변경 했다.

In [33]:
movies["Gross"] = (
    movies["Gross"]
    .str.replace("$", "", regex = False)
    .str.replace(",", "", regex = False)
    .astype(float)
)

하지만 이런한 작업은 일시적인거라서 원본 Gross Series를 변경하지는 않습니다. Gross 열을 새로운 소수점 숫자로 열로 덮어쓰는 예제입니다.

In [34]:
movies["Gross"].mean()

439.0308184143222

이제 더 많은 계산과 조작을 할 수 있습니다. mean()은 평균을 나타내는 함수입니다.

In [35]:
studios = movies.groupby("Studio")

제작사 당 영화수를 셀 수 있게 할려면 그룹화라고 진행을 해야한다. 먼저 제작사를 식별하고 각 제작사에 속한 영화를 버킷으로 지정해야 한다.

In [36]:
studios["Gross"].count().head()

Studio
Artisan                     1
Buena Vista               125
CL                          1
China Film Corporation      1
Columbia                    5
Name: Gross, dtype: int64

이제 제작사 당 영화 수를 셀 수 있다.

In [39]:
studios["Gross"].count().sort_values(ascending = False).head()

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Name: Gross, dtype: int64

제작사의 영화 수별로 Series를 정렬 할 수도 있다.

In [41]:
studios["Gross"].sum().head()

Studio
Artisan                     248.6
Buena Vista               73585.0
CL                          228.1
China Film Corporation      699.8
Columbia                   1276.6
Name: Gross, dtype: float64

각 제작사에 속한 영화의 하위 집합을 식별하고 각 하위 집합의 Gross값을 가져와 합산한다.

In [43]:
studios["Gross"].sum().sort_values(ascending = False).head()

Studio
Buena Vista        73585.0
Warner Brothers    58643.8
Fox                50420.8
Universal          44302.3
Sony               32822.5
Name: Gross, dtype: float64

여기서 이제 수익이 가장 높은 제작사를 보고 싶으면 Series값을 내림차순으로 정렬해야 한다.